Repository: phamdatt/FlashCardMobile
Catalog: FlashCardMobile/Resources/*.lproj/Localizable.strings
Languages: vi

# common.save
source: Save
vi: Lưu

# common.cancel
source: Cancel
vi: Hủy

# common.delete
source: Delete
vi: Xóa

# common.close
source: Close
vi: Đóng

# common.continue
source: Continue
vi: Tiếp tục

# common.edit
source: Edit
vi: Sửa

# common.open
source: Open
vi: Mở

# common.copy
source: Copy
vi: Sao chép

# common.start
source: Start
vi: Bắt đầu

# common.skip
source: Skip
vi: Bỏ qua

# common.next
source: Next
vi: Tiếp theo

# common.done
source: Done!
vi: Hoàn thành!

# common.view
source: View
vi: Xem

# common.check
source: Check
vi: Kiểm tra

# common.words
source: words
vi: từ

# common.lessons
source: lessons
vi: bài

# common.days
source: days
vi: ngày

# common.error
source: Error
vi: Lỗi

# common.all
source: All
vi: Tất cả

# common.unknown_error
source: Unknown error
vi: Không xác định

# tab.learn
source: Learn
vi: Học

# tab.review
source: Review
vi: Ôn tập

# tab.search
source: Search
vi: Tìm kiếm

# tab.statistics
source: Statistics
vi: Thống kê

# tab.settings
source: Settings
vi: Cài đặt

# subject.english
source: English
vi: Tiếng Anh

# subject.chinese
source: Chinese
vi: Tiếng Trung

# subject.reading
source: Reading
vi: Bài đọc

# subjects.title
source: Learning
vi: Học tập

# subjects.topics_count
source: topics
vi: chủ đề

# topics.search_placeholder
source: Search topics
vi: Tìm chủ đề

# topics.add_title
source: Add Topic
vi: Thêm chủ đề

# topics.edit_title
source: Edit Topic
vi: Sửa chủ đề

# topics.name_placeholder
source: Topic name
vi: Tên chủ đề

# topics.delete_title
source: Delete topic?
vi: Xóa chủ đề?

# topics.delete_message
source: Topic "%@" and all its vocabulary will be permanently deleted.
vi: Chủ đề "%@" và tất cả từ vựng sẽ bị xóa vĩnh viễn.

# topics.practice_all
source: Practice All
vi: Luyện tập tất cả

# topics.practice_all_subtitle
source: Review all %@
vi: Ôn tập toàn bộ %@

# topics.more_words
source: + %d more words...
vi: + %d từ khác...

# flashcard.add_title
source: Add Vocabulary
vi: Thêm từ vựng

# flashcard.edit_title
source: Edit Vocabulary
vi: Sửa từ vựng

# flashcard.delete_title
source: Delete vocabulary?
vi: Xóa từ vựng?

# flashcard.delete_message
source: The word "%@" will be permanently deleted.
vi: Từ "%@" sẽ bị xóa vĩnh viễn.

# flashcard.question_placeholder
source: Question / Hanzi
vi: Câu hỏi / Hán tự

# flashcard.answer_placeholder
source: Answer / Meaning
vi: Đáp án / Nghĩa

# flashcard.hint_placeholder
source: Hint
vi: Gợi ý

# flashcard.phonetic_placeholder
source: Phonetic / Pinyin
vi: Phiên âm / Pinyin

# flashcard.radical_placeholder
source: Radical
vi: Bộ thủ

# flashcard.notes_placeholder
source: Notes
vi: Ghi chú

# flashcard.section_vocab
source: Vocabulary
vi: Từ vựng

# flashcard.section_extra
source: Additional Info
vi: Thông tin bổ sung

# flashcard.start_practice
source: Start Practice
vi: Bắt đầu luyện tập

# flashcard.view_detail
source: View Details
vi: Xem chi tiết

# flashcard.export_csv
source: Export CSV
vi: Xuất CSV

# flashcard.import_csv
source: Import CSV
vi: Nhập CSV

# flashcard.add_vocab
source: Add Vocabulary
vi: Thêm từ vựng

# detail.title
source: Details
vi: Chi tiết

# detail.phonetic
source: Phonetic
vi: Phiên âm

# detail.meaning
source: Meaning
vi: Nghĩa

# detail.hint
source: Hint
vi: Gợi ý

# detail.radical
source: Radical
vi: Bộ thủ

# detail.radical_label
source: Radical:
vi: Bộ:

# detail.notes
source: Notes
vi: Ghi chú

# detail.copy
source: Copy Vocabulary
vi: Sao chép từ vựng

# detail.practice_similar
source: Practice Similar
vi: Luyện từ tương tự

# detail.practice_similar_subtitle
source: Distinguish similar hanzi & pinyin
vi: Phân biệt hán tự & pinyin giống nhau

# detail.speaking
source: Playing...
vi: Đang phát...

# detail.listen
source: Listen
vi: Nghe phát âm

# detail.extra_info
source: More Info
vi: Thông tin thêm

# practice.choose_type
source: Choose Practice Type
vi: Chọn kiểu luyện tập

# practice.no_cards
source: No Cards
vi: Không có thẻ

# practice.correct
source: Correct!
vi: Đúng rồi!

# practice.wrong_answer
source: Wrong - Answer: %@
vi: Sai - Đáp án: %@

# practice.wrong_alt
source: Wrong - Answer: %@
vi: Sai rồi - Đáp án: %@

# practice.score
source: %d/%d correct (%d%%)
vi: %d/%d đúng (%d%%)

# practice.settings
source: Settings
vi: Cài đặt

# practice.show_pinyin
source: Show Pinyin
vi: Hiện Pinyin

# practice.sound_toggle
source: Sound
vi: Âm thanh

# practice.loading
source: Loading vocabulary...
vi: Đang tải từ vựng...

# practice.practice
source: Practice
vi: Luyện tập

# practice.practice_all
source: Practice All
vi: Luyện tập tất cả

# practice.all_subject
source: All %@
vi: Tất cả %@

# practice.word_count
source: words in vocabulary
vi: từ trong kho từ vựng

# practice.word_quantity
source: Word count
vi: Số lượng từ

# practice.shuffle_desc
source: Will shuffle %d words for practice
vi: Sẽ trộn ngẫu nhiên %d từ để luyện tập

# practice_type.flip_card
source: Flip Card
vi: Thẻ lật

# practice_type.multiple_choice
source: Multiple Choice
vi: Trắc nghiệm

# practice_type.listening
source: Listen & Choose
vi: Nghe → chọn

# practice_type.meaning_to_hanzi
source: Meaning → Hanzi
vi: Nghĩa → Hán tự

# practice_type.similar_vocab
source: Similar Vocab
vi: Từ tương tự

# practice_type.flip_desc
source: Flip cards to memorize
vi: Lật thẻ để nhớ từ

# practice_type.mc_desc
source: Choose the correct answer
vi: Chọn đáp án đúng

# practice_type.listen_desc
source: Listen and identify words
vi: Nghe và nhận diện từ

# practice_type.hanzi_desc
source: Write hanzi from meaning
vi: Viết hán tự từ nghĩa

# mc.min_words
source: Need at least 4 words for multiple choice.
vi: Cần ít nhất 4 từ để luyện trắc nghiệm.

# flip.no_vocab
source: This topic has no vocabulary to practice.
vi: Chủ đề này chưa có từ vựng để luyện tập.

# listening.no_vocab
source: This topic has no words for listening practice.
vi: Chủ đề này chưa có từ để luyện nghe.

# listening.instruction
source: Listen and choose the correct meaning
vi: Nghe và chọn nghĩa đúng

# listening.playing
source: Playing...
vi: Đang phát...

# listening.play
source: Play
vi: Phát âm

# hanzi.no_vocab
source: This topic has no words for Meaning → Hanzi practice.
vi: Chủ đề này chưa có từ để luyện Nghĩa → Hán tự.

# hanzi.instruction
source: Meaning (write hanzi):
vi: Ý nghĩa (viết hán tự):

# hanzi.your_answer
source: Your hanzi:
vi: Hán tự của bạn:

# hanzi.placeholder
source: e.g. 你好
vi: Ví dụ: 你好

# hanzi.correct
source: Correct!
vi: Chính xác!

# hanzi.wrong
source: Incorrect
vi: Chưa đúng

# hanzi.correct_answer
source: Correct hanzi: %@
vi: Hán tự đúng: %@

# similar.loading
source: Finding similar words...
vi: Đang tìm từ tương tự...

# similar.not_found
source: No similar words found
vi: Không tìm thấy từ tương tự

# similar.not_found_desc
source: No vocabulary with similar hanzi or pinyin found.
vi: Không có từ vựng nào tương tự về hán tự hoặc pinyin.

# similar.banner
source: Similar to: %@
vi: Từ tương tự với: %@

# similar.compare
source: Compare
vi: So sánh

# similar.same_pinyin
source: Same pinyin
vi: Cùng pinyin

# similar.similar_pinyin
source: Similar pinyin
vi: Pinyin giống

# similar.similar_char
source: Similar char
vi: Chữ giống

# similar.shared_component
source: Shared component
vi: Cùng bộ thủ

# review.title
source: Review
vi: Ôn tập

# review.streak_days
source: %d days
vi: %d ngày

# review.due_count
source: %d due
vi: %d cần ôn

# review.srs_title
source: Scheduled Review
vi: Ôn tập theo lịch

# review.srs_due
source: %d cards due
vi: %d thẻ cần ôn

# review.srs_done
source: All done!
vi: Đã ôn xong!

# review.srs_subtitle
source: Practice with SRS system
vi: Luyện theo hệ thống SRS

# review.daily_title
source: Daily Practice
vi: Luyện tập mỗi ngày

# review.daily_words
source: 20 random words
vi: 20 từ ngẫu nhiên

# review.daily_subtitle
source: Daily random vocabulary quiz
vi: Trắc nghiệm từ vựng random mỗi ngày

# review.mistakes_title
source: Frequently Wrong
vi: Từ hay sai

# review.no_mistakes
source: No recent mistakes. Keep practicing!
vi: Chưa có từ nào sai gần đây. Hãy tiếp tục luyện tập!

# review.mistakes_count
source: %d words to review
vi: %d từ cần luyện lại

# review.mistakes_subtitle
source: Review frequently wrong answers
vi: Ôn lại những từ hay trả lời sai

# review.complete_title
source: Complete!
vi: Hoàn thành!

# review.complete_message
source: You've reviewed all cards for today
vi: Bạn đã ôn hết thẻ hôm nay

# review.tap_continue
source: Tap to continue
vi: Chạm để tiếp

# review.tap_reveal
source: Tap to reveal answer
vi: Chạm để xem đáp án

# review.no_vocab
source: No vocabulary
vi: Chưa có từ vựng

# review.no_vocab_desc
source: Add vocabulary before practicing.
vi: Hãy thêm từ vựng trước khi luyện tập.

# review.no_mistakes_title
source: No wrong answers
vi: Không có từ sai

# review.no_mistakes_desc
source: You haven't gotten any wrong recently.
vi: Bạn chưa trả lời sai từ nào gần đây.

# review.random_daily
source: Daily Random
vi: Random hàng ngày

# review.mistakes_type
source: Frequently Wrong
vi: Từ hay sai

# stats.title
source: Statistics
vi: Thống kê

# stats.record
source: Record
vi: Kỷ lục

# stats.progress
source: Learning Progress
vi: Tiến độ học tập

# stats.mastered
source: Mastered
vi: Đã thuộc

# stats.learning
source: Learning
vi: Đang học

# stats.new
source: New
vi: Chưa học

# stats.mastered_label
source: mastered
vi: đã thuộc

# stats.frequently_wrong
source: Often Wrong
vi: Hay sai

# stats.overview
source: Overview
vi: Tổng quan

# stats.total_words
source: Total
vi: Tổng từ

# stats.due_review
source: Due
vi: Cần ôn

# stats.by_subject
source: By Subject
vi: Theo môn học

# stats.no_mastered
source: No mastered words yet
vi: Chưa có từ nào thuộc

# stats.no_mastered_desc
source: Keep practicing to master vocabulary!
vi: Tiếp tục luyện tập để thuộc từ vựng!

# stats.mastered_title
source: Mastered Words (%d)
vi: Từ đã thuộc (%d)

# stats.no_wrong
source: No frequently wrong words
vi: Không có từ hay sai

# stats.no_wrong_desc
source: You're doing great!
vi: Bạn đang làm rất tốt!

# stats.wrong_title
source: Frequently Wrong
vi: Từ hay sai

# stats.wrong_count
source: wrong %dx
vi: sai %dx

# stats.words_topics
source: %d words u{2022} %d topics
vi: %d từ u{2022} %d chủ đề

# settings.title
source: Settings
vi: Cài đặt

# settings.backup_title
source: Backup & Export SQLite
vi: Sao lưu & Xuất SQLite

# settings.data_section
source: Data
vi: Dữ liệu

# settings.data_footer
source: Backup, export, or restore database.
vi: Sao lưu, xuất hoặc khôi phục database.

# settings.appearance
source: Appearance
vi: Giao diện

# settings.appearance_section
source: Display Mode
vi: Chế độ hiển thị

# settings.appearance_footer
source: Choose Light or Dark to lock, or System to follow device settings.
vi: Chọn Sáng hoặc Tối để cố định, hoặc Hệ thống để theo cài đặt thiết bị.

# settings.language
source: Language
vi: Ngôn ngữ

# settings.language_section
source: Language
vi: Ngôn ngữ

# appearance.system
source: System
vi: Hệ thống

# appearance.light
source: Light
vi: Sáng

# appearance.dark
source: Dark
vi: Tối

# search.title
source: Search Vocabulary
vi: Tìm từ vựng

# search.placeholder
source: Search by word, meaning, hint...
vi: Tìm theo từ, nghĩa, gợi ý...

# search.empty_title
source: Search Vocabulary
vi: Tìm từ vựng

# search.empty_desc
source: Enter a keyword to search by question, answer, hint, or phonetic
vi: Nhập từ khóa để tìm theo câu hỏi, đáp án, gợi ý hoặc phiên âm

# onboarding.page1_title
source: Learn Vocabulary by Topic
vi: Học từ vựng theo chủ đề

# onboarding.page1_desc
source: Choose a subject and topic to start learning. Supports English, Chinese, and Reading.
vi: Chọn môn học và chủ đề để bắt đầu học từ vựng. Hỗ trợ Tiếng Anh, Tiếng Trung và Bài đọc.

# onboarding.page2_title
source: Multiple Practice Modes
vi: Nhiều kiểu luyện tập

# onboarding.page2_desc
source: Flip cards, multiple choice, listening quiz. Chinese also has Meaning → Hanzi practice.
vi: Thẻ lật, trắc nghiệm, nghe chọn đáp án. Tiếng Trung còn có luyện Nghĩa → Hán tự.

# onboarding.page3_title
source: SRS Scheduled Review
vi: Ôn tập theo lịch SRS

# onboarding.page3_desc
source: The system reminds you to review vocabulary at the right time for long-term memory.
vi: Hệ thống tự nhắc bạn ôn lại từ vựng đúng thời điểm để ghi nhớ lâu hơn.

# onboarding.page4_title
source: Track Your Progress
vi: Theo dõi tiến độ

# onboarding.page4_desc
source: View streaks, learning statistics, and track your improvement.
vi: Xem streak, thống kê học tập và theo dõi sự tiến bộ của bạn.

# splash.subtitle
source: Learn vocabulary effectively
vi: Học từ vựng hiệu quả

# splash.bravo
source: Great!
vi: Giỏi!

# csv.export_title
source: Export Vocabulary to CSV
vi: Xuất từ vựng ra CSV

# csv.export_topic
source: Topic: %@
vi: Chủ đề: %@

# csv.export_action
source: Export & Share
vi: Xuất và chia sẻ

# csv.export_nav
source: Export CSV
vi: Xuất CSV

source: CSV Export Error
vi: Lỗi xuất CSV

# csv.no_data
source: No data to export.
vi: Không có dữ liệu để xuất.

# csv.import_title
source: Import Vocabulary from CSV
vi: Nhập từ vựng từ CSV

# csv.import_topic
source: Topic: %@
vi: Chủ đề: %@

# csv.import_success
source: Imported %d words
vi: Đã nhập %d từ vựng

# csv.import_errors
source: %d errors
vi: %d lỗi

# csv.import_pick
source: Choose CSV file
vi: Chọn file CSV

# backup.save_sqlite
source: Backup SQLite
vi: Sao lưu SQLite

# backup.export_sqlite
source: Export SQLite
vi: Xuất SQLite

# backup.restore
source: Restore from backup
vi: Khôi phục từ backup

# backup.title
source: Backup & Restore
vi: Sao lưu & Khôi phục

# backup.footer
source: Backups are saved to Files > FlashCardMobile > Backups. Export SQLite shares via iCloud, AirDrop, etc.
vi: Sao lưu lưu vào Files > FlashCardMobile > Backups. Xuất SQLite chia sẻ file qua iCloud, AirDrop, v.v.

# backup.data_section
source: Backup Data
vi: Sao lưu dữ liệu

# backup.restore_error
source: Unable to restore file.
vi: Không thể khôi phục file.

# backup.saved_title
source: Backed Up
vi: Đã sao lưu

# backup.saved_message
source: Saved to: %@ Open Files > FlashCardMobile > Backups to view.
vi: Đã lưu vào: %@ Mở Files > FlashCardMobile > Backups để xem.

# backup.save_error
source: Unable to backup database.
vi: Không thể sao lưu database.

# backup.export_error
source: Unable to create export file.
vi: Không thể tạo file xuất.

# backup.success_default
source: Backup successful.
vi: Sao lưu thành công.

# csv.create_error
source: Cannot create file: %@
vi: Không thể tạo file: %@

# reading.empty
source: No readings yet
vi: Chưa có bài đọc

# reading.empty_desc
source: This topic has no readings yet.
vi: Chủ đề này chưa có bài đọc nào.

# reading.title
source: Reading
vi: Bài đọc

# speech.no_voice
source: No voice available. Go to Settings → Accessibility → Spoken Content to download a voice.
vi: Chưa có giọng đọc. Vào Cài đặt → Trợ năng → Nội dung đọc để tải giọng.
